wolfSSL/wolfTrust/port/stm32h563/platform_stm32h563.c
static void wt_uart_gpio_init(void)
{
    static const whal_Stm32h5_Rcc_PeriphClk gpio_clocks[] = {
        {WHAL_STM32H563_GPIOA_CLOCK},
        {WHAL_STM32H563_GPIOD_CLOCK},
    };

    for (size_t i = 0u; i < sizeof(gpio_clocks) / sizeof(gpio_clocks[0]); ++i) {
        wt_rcc_enable_clock(WT_RCC_BASE_S, &gpio_clocks[i]);
    }
    (void)WT_RCC_AHB2ENR;
    WT_PWR_CR2 |= WT_PWR_CR2_IOSV;

    /* USART2 on PA2/PA3, USART3 VCP on PD8/PD9. */
    wt_configure_uart_gpio_pin(WT_GPIOA_BASE_S, 2u, 7u);
    wt_configure_uart_gpio_pin(WT_GPIOA_BASE_S, 3u, 7u);
    wt_configure_uart_gpio_pin(WT_GPIOD_BASE_S, 8u, 7u);
    wt_configure_uart_gpio_pin(WT_GPIOD_BASE_S, 9u, 7u);
}

void wt_platform_init(void)
{
    static const whal_Stm32h5_Rcc_PeriphClk uart_clocks[] = {
        {WHAL_STM32H563_USART2_CLOCK},
        {WHAL_STM32H563_USART3_CLOCK},
    };
    static const whal_Stm32h5_Rcc_PeriphClk rng_clock =
        {WHAL_STM32H563_RNG_CLOCK};

    wt_clock_init();
    /* Arm the FF-M NS-window checks before any NS guest can reach the
     * WolfTrust_FFM_* veneers; the core fails closed until this runs. */
    wt_ffm_gateway_install();
    /* The signed wolfBoot handoff reserves the manifest header at the slot
     * base; the Secure vector table begins at the image base after it. */
    WT_SCB_VTOR_S = WT_FLASH_IMAGE_BASE;
    wt_gtzc_init();
    wt_armv8m_sau_init(g_sau_regions,
                       sizeof(g_sau_regions) / sizeof(g_sau_regions[0]));
    wt_armv8m_mpu_s_init(g_mpu_s_whitelist,
                         sizeof(g_mpu_s_whitelist) /
                         sizeof(g_mpu_s_whitelist[0]));
    wt_arch_init();
    /* Enable USART2/USART3 clocks in both security views before guests run. */
    for (size_t i = 0u; i < sizeof(uart_clocks) / sizeof(uart_clocks[0]); ++i) {
        wt_rcc_enable_clock(WT_RCC_BASE_S, &uart_clocks[i]);
        wt_rcc_enable_clock(WT_RCC_BASE_NS, &uart_clocks[i]);
    }
    wt_rcc_enable_clock(WT_RCC_BASE_S, &rng_clock);
    wt_uart_gpio_init();
    wt_arch_zero_guest_memory(WT_GUEST0_RAM_BASE, WT_GUEST_RAM_SIZE);
    wt_arch_zero_guest_memory(WT_GUEST1_RAM_BASE, WT_GUEST_RAM_SIZE);
    g_secure_service_depth = 0u;
    g_hsm_wait_skip_count = 0u;
}

/* GTZC curtain (cross-guest isolation): NS guest kernels run privileged, so
 * the per-guest NS MPU alone cannot stop a hostile guest from reprogramming
 * MPU_NS and reaching the peer's RAM. Every dispatch closes the whole shared
 * guest RAM extent at the fabric (blocks marked Secure reject Non-secure
 * transactions regardless of privilege) and reopens only the arriving
 * guest's declared writable windows. */
void wt_platform_program_memory_windows(const wt_memory_window_t* windows,
                                        size_t count)
{
    uintptr_t extent_end = WT_GUEST1_RAM_BASE + WT_GUEST_RAM_SIZE;
    size_t nsWords = (extent_end - WT_RAM_NS_BASE) / (512u * 32u);
    size_t i;
    size_t w;

    for (i = 0; i < nsWords && i < 16u; ++i) {
        WT_GTZC1_MPCBB1_SECCFGR[i] = 0xFFFFFFFFu;
    }
    for (w = 0; windows != NULL && w < count; ++w) {
        uintptr_t base = windows[w].base;
        uintptr_t end = base + windows[w].size;
        size_t block;
        size_t first;
        size_t last;

        if ((windows[w].attributes & WT_MEM_ATTR_WRITE) == 0u ||
                base < WT_RAM_NS_BASE || end > extent_end || end <= base) {
            continue;
        }
        first = (base - WT_RAM_NS_BASE) / 512u;
        last = (end - WT_RAM_NS_BASE + 511u) / 512u;
        for (block = first; block < last; ++block) {
            WT_GTZC1_MPCBB1_SECCFGR[block / 32u] &=
                ~(1u << (block % 32u));
        }
    }
    wt_dsb();
    wt_isb();
}

/* End of executable image code (secure.ld): the SP thread tables grant RX up
 * to here (the manifest's 4K code window lies inside it and Armv8-M regions
 * must not overlap — task #26 tracks per-partition narrowing) and the rest of
 * the image window (constant data and the signed tail) read-only XN
 * (WT-FFM-0010). */
extern char _e_secure_text[];

size_t wt_platform_sp_shared_regions(wt_memory_region_t* regions, size_t max)
{
    if (max < 2u) {
        return 0u;
    }
    regions[0].base = WT_FLASH_S_BASE;
    regions[0].size = (uintptr_t)_e_secure_text - WT_FLASH_S_BASE;
    regions[0].attributes = WT_MEM_ATTR_READ | WT_MEM_ATTR_EXEC;
    regions[1].base = (uintptr_t)_e_secure_text;
    regions[1].size = WT_FLASH_S_BASE + WT_FLASH_S_SIZE -
                      (uintptr_t)_e_secure_text;
    regions[1].attributes = WT_MEM_ATTR_READ;
    return 2u;
}

#if defined(WT_CONFORMANCE) && (WT_CONFORMANCE == 1)
/* Per-partition private data bands (secure.ld), each denied to other SPs. */
extern char _s_conf_server_data[];
extern char _e_conf_server_data[];
extern char _s_conf_driver_data[];
extern char _e_conf_driver_data[];

/* Append one RW grant segment to an SP's thread table (skips empty segments,
 * fails closed by granting nothing when the table is full). */
static size_t wt_conf_grant(wt_memory_region_t* regions, size_t count,
                            size_t max, uintptr_t base, uintptr_t end)
{
    if (base < end && count < max) {
        regions[count].base = base;
        regions[count].size = (uint32_t)(end - base);
        regions[count].attributes = WT_MEM_ATTR_READ | WT_MEM_ATTR_WRITE;
        count++;
    }
    return count;
}

/* Hosted Arm partitions read their val_api/psa_api tables from .data, which
 * the linker places in the shared CONFDATA window; grant it so the SP
 * reaches its own data while SPM RAM stays denied. The per-partition
 * pseudo-MMIO holes at the top of the window (memory_map.h) each belong to
 * exactly one partition — every other SP gets the window with that hole
 * carved out, so the L3 MMIO-isolation panic tests (i047/i055/i057) hit a
 * genuine out-of-domain access and the must-panic reset path fires. Also
 * carve the per-partition data bands (i080/i084): a cross-partition read of
 * another SP's .data/.bss must fault. Bands are adjacent, so a non-owner's
 * empty middle segment is skipped by wt_conf_grant. */
size_t wt_platform_conf_sp_grants(int32_t partition_id,
                                  wt_memory_region_t* regions,
                                  size_t count, size_t max)
{
    uintptr_t conf_seg = WT_CONF_SP_DATA_BASE;

