wolfSSL/wolfTrust/port/stm32h563/platform_stm32h563.c
    if (partition_id != SERVER_PARTITION_ID) {
        count = wt_conf_grant(regions, count, max, conf_seg,
                              (uintptr_t)_s_conf_server_data);
        conf_seg = (uintptr_t)_e_conf_server_data;
    }
    if (partition_id != DRIVER_PARTITION_ID) {
        count = wt_conf_grant(regions, count, max, conf_seg,
                              (uintptr_t)_s_conf_driver_data);
        conf_seg = (uintptr_t)_e_conf_driver_data;
    }
    if (partition_id != SERVER_PARTITION_ID) {
        count = wt_conf_grant(regions, count, max, conf_seg,
                              WT_CONF_SERVER_MMIO_BASE);
        conf_seg = WT_CONF_SERVER_MMIO_BASE + WT_CONF_SERVER_MMIO_SIZE;
    }
    if (partition_id != DRIVER_PARTITION_ID) {
        count = wt_conf_grant(regions, count, max, conf_seg,
                              WT_CONF_DRV_MMIO_BASE);
        conf_seg = WT_CONF_DRV_MMIO_BASE + WT_CONF_DRV_MMIO_SIZE;
    }
    count = wt_conf_grant(regions, count, max, conf_seg,
                          WT_CONF_SP_DATA_BASE + WT_CONF_SP_DATA_SIZE);
    return count;
}
#endif

#if (defined(WT_FFM_NEGATIVE_PROBE) && (WT_FFM_NEGATIVE_PROBE == 1)) || \
    (defined(WT_VNET_NEG_PROBE) && (WT_VNET_NEG_PROBE == 1)) || \
    (defined(WT_KEYSTORE_NEG_PROBE) && (WT_KEYSTORE_NEG_PROBE == 1))
uintptr_t wt_platform_probe_address(unsigned int target)
{
    switch (target) {
    case WT_PROBE_KEYSTORE_BAND:
        return (uintptr_t)WT_KEYSTORE_BASE;
#if defined(CONFIG_VNET)
    case WT_PROBE_VNET_DATA_BAND:
        return (uintptr_t)WT_VNET_DATA_BASE;
#endif
    default:
        return (uintptr_t)WT_RAM_S_BASE;
    }
}
#endif

void wt_platform_log_fault(wt_guest_id_t guest_id,
                           wt_fault_reason_t reason,
                           uintptr_t fault_address,
                           uintptr_t pc)
{
    (void)guest_id;
    (void)reason;
    wt_armv8m_note_fault(fault_address, pc);
}

void wt_platform_all_guests_faulted(void)
{
    __asm volatile("bkpt #0x7D");
    for (;;) {
        __asm volatile("wfi");
    }
}

void wt_platform_panic(void)
{
    __asm volatile("bkpt #0x7E");
    for (;;) {
    }
}

#ifdef WT_LAUNCH_DEBUG
/* Temporary launch-verify triage: one distinct BKPT per failure reason so the
 * emulator log names the guest and error. Never built into production. */
void wt_platform_launch_debug(int code, uint32_t guest)
{
    unsigned int index = (unsigned int)(-700 - code);

    if (index > 5u) {
        index = 6u;
    }
    switch (index + (guest * 8u)) {
        case 0u:  __asm volatile("bkpt #0x50"); break;
        case 1u:  __asm volatile("bkpt #0x51"); break;
        case 2u:  __asm volatile("bkpt #0x52"); break;
        case 3u:  __asm volatile("bkpt #0x53"); break;
        case 4u:  __asm volatile("bkpt #0x54"); break;
        case 5u:  __asm volatile("bkpt #0x55"); break;
        case 8u:  __asm volatile("bkpt #0x58"); break;
        case 9u:  __asm volatile("bkpt #0x59"); break;
        case 10u: __asm volatile("bkpt #0x5A"); break;
        case 11u: __asm volatile("bkpt #0x5B"); break;
        case 12u: __asm volatile("bkpt #0x5C"); break;
        case 13u: __asm volatile("bkpt #0x5D"); break;
        default:  __asm volatile("bkpt #0x5F"); break;
    }
}
#endif

void wt_platform_system_reset(void)
{
    uint32_t spins = 0u;

    /* A flash program issued just before this reset - the conformance boot
     * flag val resumes from, an anti-rollback arming store - must physically
     * land before SYSRESETREQ, or the reset can cut it short and the value is
     * lost (on silicon the panic test then re-runs into a reboot loop; the
     * emulator programs flash instantly and never sees it). Wait for the flash
     * controller to go idle, bounded so a wedged controller still resets. */
    while ((WT_FLASH_SR & (WT_FLASH_SR_BSY | WT_FLASH_SR_DBNE)) != 0u &&
            spins < 0x00200000u) {
        spins++;
    }
    wt_dsb();
    WT_SCB_AIRCR_S = WT_SCB_AIRCR_SYSRESETREQ;
    wt_dsb();
    for (;;) {
    }
}

#if defined(WT_CONFORMANCE) && (WT_CONFORMANCE == 1)
/* PAL interrupt source (P4.2c): LPUART1 with TXEIE raises its NVIC line as
 * soon as the transmitter is enabled (TXE idles high), giving the DRIVER
 * partition a real peripheral interrupt to receive and acknowledge. */
void wt_conf_uart_irq_set(int on)
{
    if (on != 0) {
        WT_LPUART1_CR1 |= WT_LPUART1_CR1_UE | WT_LPUART1_CR1_TE |
                          WT_LPUART1_CR1_TXEIE;
    } else {
        WT_LPUART1_CR1 &= ~WT_LPUART1_CR1_TXEIE;
        wt_arch_secure_irq_disable(WT_LPUART1_IRQ);
    }
}

void LPUART1_IRQHandler(void)
{
    wt_spm_conf_irq(WT_LPUART1_IRQ);
}
#endif

#if defined(WT_REMEASURE_PROBE)
/* P6-S5: prove on-demand runtime re-measurement (WT-FFM-0052) on target. After
 * boot init and launch verification, an untampered re-measure of guest0 must
 * pass; a post-launch in-flash tamper (the secure MPU maps flash
 * privileged-RO, so it is dropped for the single program) must then be caught
 * and quarantine the guest. bkpt #0x6C fires only when both are correct. */
extern int wt_hsm_flash_remeasure_tamper(uintptr_t secure_base);

void wt_platform_remeasure_probe(void)
{
    const wt_guest_config_t *configs;
    size_t cfg_count;
    const wt_memory_window_t *window = NULL;
    uint32_t mpu_ctrl;
    size_t i;
    int r1;
    int r2;

    configs = wt_partitions_config_table(&cfg_count);
    if (configs != NULL && cfg_count > 0u) {
        for (i = 0u; i < configs[0].memory_window_count; i++) {
            if ((configs[0].memory_windows[i].attributes &
                    WT_MEM_ATTR_EXEC) != 0u) {
                window = &configs[0].memory_windows[i];
                break;
            }
        }
    }
    if (window != NULL) {
        r1 = wt_runtime_verify_guest(0u);
        mpu_ctrl = WT_MPU_S_CTRL;
        WT_MPU_S_CTRL = 0u;
        wt_dsb();
        wt_isb();
        (void)wt_hsm_flash_remeasure_tamper(WT_FLASH_TO_S_ALIAS(window->base));
        WT_MPU_S_CTRL = mpu_ctrl;
        wt_dsb();
        wt_isb();
        r2 = wt_runtime_verify_guest(0u);
        /* WT_GUEST_VERIFY_OK == 0: a pass then a fail-closed is the only
         * correct outcome. */
        if (r1 == 0 && r2 != 0) {
            __asm volatile("bkpt #0x6C");
        }
    }
    for (;;) {
        __asm volatile("wfi");
    }
}
#endif

